package EX03;

public class Item15 {
    /**
     * 클래스와 멤버의 접근 권한을 최소화 하라
     *
     * ! 모든 클래스와 멤버의 접근성을 가능한 한 좁혀야 한다.
     *
     * 정보 은닉의 장점
     * - 여러 컴포넌트를 병렬로 개발할 수 있어 개발 속도를 높인다
     * - 시스템 관리비용을 낮춘다, 디버깅이 쉽고 교체하는 부담도 적다.
     * - 성능 최적화에 도움을 준디.
     * - 뛰어난 재사용성을 가진다.
     * - 시스템 제작의 난이도를 낮춘다.
     *
     * 접근 수준
     * - private : 톱레벨 클래스에서만 접근
     * - package-private : 소속된 패키지 안의 모든 클래스 에서 접근
     * - protected : 소속된 패키지 + 하위클래스에서 접근
     * - public : 모든 클래스에서 접근
     *
     * ! public 클래스의 인스턴스 필드는 public이 아니여야 한다
     * ! public static final [] 필드를 두거나 접근자 메서드는 제공해선 안된다다
     *  ㄴ 사용할거면 불변리스트 추가 & 방어적 복사가 있다.
     *
     * */
}
